app/Controllers/User.php

    public function getCountriesList(){
        $countries=$this->countryModel->findAll();
---
SELECT *
FROM `country`

    public function getStatesList(){
        $states=$this->stateModel->findAll();
---
SELECT *
FROM `state`

    public function getCitiesList(){
        $cities=$this->cityModel->findAll();
---
SELECT *
FROM `city`

    public function getUserDetails(){

        $userId=$this->request->getGet('user_id');
        $user  =$this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'