app/Models/UserModel.php

    public function getUsersWithLocation()
    {
        return $this->select('users.*, country.country_name, state.state_name, city.city_name')
                    ->join('country', 'country.id = users.country_id','left')
                    ->join('state', 'state.id = users.state_id','left')
                    ->join('city', 'city.id = users.city_id','left')
                    ->findAll();
---
SELECT `users`.*, `country`.`country_name`, `state`.`state_name`, `city`.`city_name`
FROM `users`
LEFT JOIN `country` ON `country`.`id` = `users`.`country_id`
LEFT JOIN `state` ON `state`.`id` = `users`.`state_id`
LEFT JOIN `city` ON `city`.`id` = `users`.`city_id`